# Задание 2: Площадь прямоугольника
# Программа запрашивает длину и ширину
# Считает площадь и выводит результат

length = int(input("Введите длину прямоугольника: "))
width = int(input("Введите ширину прямоугольника: "))
area = length * width
print(f"Площадь прямоугоника: {area}")
